Repository: 84000/data-translation-memory
Catalog: toh346-v3.tmx
Source language: bo
Languages: en

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་རས་གཅིག་མི་བཅྭ་བརྒྱད་ཀྱིས་དྲས་ཀྱང་མ་རལ་བར་རྨི་ལམ་དུ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་དེ་ཉིད་ཀྱི་བསྟན་པ་སྡེ་བཅྭ་བརྒྱད་དུ་གྱེས་པར་གྱུར་ཀྱང་རྣམ་པར་གྲོལ་བའི་རས་ནི་རལ་བར་བྱ་བར་མི་ནུས་ཏེ་དེའི་སྔ་ལྟས་ཡིན་ནོ། །
en: “ ‘Great King, your dream of a piece of cloth not being torn though it was pulled by eighteen men is a premonition that although the teaching on reality will be split into eighteen factions, the cloth of liberation cannot be torn.

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་གཅིག་ཏུ་འདུས་ནས་འཐབ་པ་དང་རྩོད་པ་དང་གཡུལ་འགྱེད་པ་དང་། མཚང་འདྲུ་བར་རྨི་ལམ་དུ་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་དེ་ཉིད་ཀྱི་བསྟན་པ་རྩོད་པས་ནུབ་པར་འགྱུར་ཏེ་དེའི་སྔ་ལྟས་ཡིན་ནོ། །
en: “ ‘Great King, your dream of a great crowd of people assembled together quarreling, arguing, fighting, and criticizing one another other is a premonition that the teaching on reality will fade away through dispute.

source: རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟར་མི་བཟད་པ་རྣམས་མ་འོངས་པའི་དུས་ན་འབྱུང་བར་འགྱུར་རོ། །
en: “ ‘Great King, such unbearable things will come to pass in the future.’

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གང་བཅོམ་ལྡན་འདས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལའང་རྒྱལ་པོ་ཀྲྀ་ཀཱི་དང་། གསེར་ཕྲེང་ཅན་གྱིས་ཐར་པའི་ཆ་དང་འཐུན་པའི་དགེ་བའི་རྩ་བ་རྣམས་བསྐྱེད་པ་ཡིན་ནོ། །
en: “And with these words, King Kṛkin and Kāñcanamālā generated roots of virtue toward the perfectly and completely awakened Buddha Kāśyapa that made them conducive to liberation.

source: དགེ་སློང་དག་འདི་ཇི་སྙམ་དུ་སེམས།
en: “Monks, what do you think?

source: དེའི་ཚེ་ན་གསེར་ཕྲེང་ཅན་གང་ཡིན་པ་དེ་ནི་མ་ག་དྷཱ་བཟང་མོ་འདི་ཉིད་ཡིན་ཏེ།
en: The one known at that time as Kāñcanamālā was this Sumāgadhā herself.

source: དེའི་ཚེ་ཡང་འདིས་སངས་རྒྱས་ཀྱི་བྱ་བ་བྱས་ཏེ། ད་ལྟར་ཡང་འདི་འོངས་ནས་སངས་རྒྱས་ཀྱི་བྱ་བ་བྱས་སོ། །
en: At that time she performed buddha activity, and likewise she has come here and once again performed buddha activity.”

source: ཡང་དགེ་སློང་རྣམས་ཐེ་ཙོམ་སྐྱེས་ནས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་གསེར་ཕྲེང་ཅན་གྱིས་ལས་ཅི་ཞིག་བགྱིས་ན་གསེར་གྱི་ཕྲེང་བ་བཏགས་པར་སྐྱེས།
en: Then the monks, with doubts arising, inquired of the blessed Buddha, “Reverend One, due to what former action was Kāñcanamālā born tied with a golden garland?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདི་ཉིད་ཀྱིས་ལས་བྱས་པ་ཡོད་དེ། སྔོན་བྱུང་བ་ན་ཞིང་པ་གཞན་ཞིག་གི་ཆུང་མར་གྱུར་ཏེ། རང་སངས་རྒྱས་ཀྱི་མཆོད་རྟེན་ལ་ཁ་དོག་སྣ་ཚོགས་པའི་མེ་ཏོག་རྣམས་ཀྱི་ཕྲེང་བ་བྱས་ནས་བཏགས་ཏེ།
en: The Blessed One replied, “Monks, it was due to this action: Long ago, the wife of some farmer or other made garlands of variously colored flowers and tied them up at the caitya of a pratyekabuddha.

source: ལས་དེའི་རྣམ་པར་སྨིན་པས་གསེར་གྱི་ཕྲེང་བ་བཏགས་པར་སྐྱེས་སོ། །
en: By the ripening of that action, she was born tied with a golden garland.

source: དེ་བས་ན་དགེ་སློང་དག་ལས་གཅིག་ཏུ་གནག་པ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་གཅིག་ཏུ་གནག་པ་ཡིན་ལ། གཅིག་ཏུ་དཀར་བ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་གཅིག་ཏུ་དཀར་བ་ཡིན་ཏེ། འདྲེན་མ་རྣམས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་འདྲེན་མའོ། །
en: Therefore, monks, the ripening of purely dark actions is purely dark, the ripening of those that are purely white is purely white, and the ripening of those that are mixed is mixed.

source: དགེ་སློང་དག་དེ་བས་ན་ལས་གཅིག་ཏུ་གནག་པ་རྣམས་དང་འདྲེན་མ་རྣམས་ནི་སྤངས་ལ། ལས་གཅིག་ཏུ་དཀར་བ་རྣམས་ལ་མངོན་པར་བརྩོན་པར་བྱ་སྟེ།
en: Therefore, monks, you should abandon purely dark and mixed actions and exert yourselves in purely white actions.

source: དགེ་སློང་དག་ཁྱེད་རྣམས་ཀྱིས་དེ་ལྟར་བསླབ་པར་བྱའོ། །
en: Monks, you should train in this way.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། དགེ་སློང་རྣམས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ། །
en: Thus spoke the Blessed One, and the monks thoroughly praised the words of the Blessed One.

source: མ་ག་དྷཱ་བཟང་མོའི་རྟོགས་པ་བརྗོད་པ་རྫོགས་སོ།། །།
en: This completes “The Exemplary Tale of Sumāgadhā.”

source: རྒྱ་གར་གྱི་མཁན་པོ་དྷརྨ་ཤྲཱི་བྷ་དྲ་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་དགེ་སློང་ཚུལ་ཁྲིམས་ཡོན་ཏན་གྱིས་བསྒྱུར་ཏེ། སྒྲ་སྒྱུར་གྱི་ལོཙྪ་བ་ཆེན་པོ་དགེ་སློང་རིན་ཆེན་བཟང་པོས་བཅོས་ཏེ་གཏན་ལ་ཕབ་པ།​། །​།
en: Translated by the Indian preceptor Dharmaśrībhadra and the senior editor and translator, the monk Tsültrim Yönten. Corrected and finalized by the great translator, the monk Rinchen Sangpo.
